export const json = {
  locale: "ar",
  logoPosition: "right",
  pages: [
    {
      name: "page1",
      elements: [
        {
          type: "radiogroup",
          name: "ما هو الغرض الاساسي للاستخدام حاسوبك المحمول؟",
          isRequired: true,
          choices: ["التصفح", "التعليم", "العمل", "العاب"],
        },
      ],
    },
    {
      name: "page2",
      elements: [
        {
          type: "radiogroup",
          name: "كيف تصف العمل الخاص بك على حاسوبك المحمول؟",
          isRequired: true,
          visibleIf:
            "{ما هو الغرض الاساسي للاستخدام حاسوبك المحمول؟} = 'العمل'",
          choices: [
            "عمل يحتاج الى مواصفات منخفضة",
            "عمل يحتاج الى مواصفات متوسطة",
            "عمل يحتاج الى مواصفات عالية",
          ],
        },
        {
          type: "radiogroup",
          name: "كيف تصف الدراسة الخاصة بك على حاسوبك المحمول؟",
          isRequired: true,
          visibleIf:
            "{ما هو الغرض الاساسي للاستخدام حاسوبك المحمول؟} = 'التعليم'",
          choices: ["طالب مدرسة", "طالب جامعة", "تعليم ذاتي"],
        },
        {
          type: "radiogroup",
          name: "كيف تصف العاب الخاصة بك على حاسوبك المحمول؟",
          isRequired: true,
          visibleIf:
            "{ما هو الغرض الاساسي للاستخدام حاسوبك المحمول؟} = 'العاب'",
          choices: [
            "العاب تحتاج الى مواصفات منخفضة",
            "العاب تحتاج الى مواصفات متوسطة",
            "العاب تحتاج الى مواصفات عالية",
          ],
        },
      ],
    },
    {
      name: "page3",
      elements: [
        {
          type: "radiogroup",
          name: "ما هي الكلية او المعهد التي تدرس به ؟",
          isRequired: true,
          visibleIf:
            "{كيف تصف الدراسة الخاصة بك على حاسوبك المحمول؟} = 'طالب جامعة'",
          choices: [
            "هندسة العمارة او المدني",
            "اقسام الهندسات الاخرى",
            "المعاهد او باقي الكليات",
          ],
        },
      ],
    },
    {
      name: "page4",
      elements: [
        {
          type: "boolean",
          description: {
            ar: `تعني المتطلبات المتوسطة عمومًا أن الكمبيوتر المحمول لديه القدرة على استخدام  
            و برامج تصميم الجرافيك (...Adobe Photoshop)
            طالما أنك لا تعمل مع ملفات كبيرة جدًا أو مشاريع معقدة
            و برامج البرمجة والتطوير(...Visual Studio Code)
            والالعاب الاساسية (...Fortnite)
            طالما أنك لا تمانع في اللعب على إعدادات رسومات أقل.
            ، ولكنها قد لا تكون مناسبة تمامًا للمهام الأكثر تطلبًا مثل العرض ثلاثي الأبعاد 
            أو تحرير الفيديو (مونتاج) أو تشغيل البرامج والألعاب عالية الأداء.`,

            // ar: "اذا كنت ترغب في استخدام حاسوبك المحمول للاغراض الاخرى و للبرامج والالعاب التي تتطلب اداء ومتطلبات متوسطة فرجاء اختر الخيار نعم",
          },
          name: "هل تستخدم الحاسب المحمول ايضا للبرامج تعديل الصور او العاب ذات متطلبات متوسطة؟",
          isRequired: true,

          visibleIf:
            "{كيف تصف الدراسة الخاصة بك على حاسوبك المحمول؟} anyof ['طالب مدرسة', 'تعليم ذاتي']" +
            " or {ما هي الكلية او المعهد التي تدرس به ؟} = 'المعاهد او باقي الكليات' " +
            " or  {كيف تصف العاب الخاصة بك على حاسوبك المحمول؟}='العاب تحتاج الى مواصفات منخفضة' " +
            " or   {كيف تصف العمل الخاص بك على حاسوبك المحمول؟} ='عمل يحتاج الى مواصفات منخفضة' " +
            " or  {ما هو الغرض الاساسي للاستخدام حاسوبك المحمول؟} ='التصفح'",
        },
      ],
    },
    {
      name: "page5",
      elements: [
        {
          type: "boolean",
          description: {
            ar: `تعني المتطلبات العالية عمومًا أن الكمبيوتر المحمول يحتاج 
            إلى معالج قوي وبطاقة رسومات متطورة وكثير من الذاكرة
             للتعامل مع المهام الصعبة 
             مثل برامج النمذجة والرسوم المتحركة ثلاثية الأبعاد (...3ds Max) أو
              تحرير الفيديو (...Adobe Premiere Pro) أو
               برامج الواقع الافتراضي والألعاب عالية الاداء(...Unity,...Steam VR) أو
              تشغيل البرامج المعقدة (...MATLAB) 
              وبشكل عام أجهزة الكمبيوتر عالية الأداء تتطلب الكثير من طاقة المعالجة والذاكرة وطبعا سيكون أكثر تكلفة ولكنه سيكون قادرًا على التعامل مع المهام الصعبة بسهولة أكبر.`,
            // ar: "اذا كنت ترغب في استخدام حاسوبك المحمول للاغراض الاخرى و للبرامج وللالعاب التي تتطلب اداء ومتطلبات عالية فرجاء اختر الخيار نعم",
          },
          name: "هل سوف تستخدم جهازك المحمول أيضا  للبرامج الاحترافية او الالعاب الضخمة؟",
          isRequired: true,
          choices: ["نعم", "لا"],
          visibleIf:
            "{كيف تصف الدراسة الخاصة بك على حاسوبك المحمول؟} anyof ['طالب مدرسة', 'تعليم ذاتي']" +
            " or {ما هي الكلية او المعهد التي تدرس به ؟} =  'المعاهد او باقي الكليات' " +
            " or {ما هي الكلية او المعهد التي تدرس به ؟} =  'اقسام الهندسات الاخرى' " +
            " or {كيف تصف العاب الخاصة بك على حاسوبك المحمول؟} =  'العاب تحتاج الى مواصفات متوسطة' " +
            " or {كيف تصف العاب الخاصة بك على حاسوبك المحمول؟} =  'العاب تحتاج الى مواصفات منخفضة' " +
            " or {كيف تصف العمل الخاص بك على حاسوبك المحمول؟} =  'عمل يحتاج الى مواصفات متوسطة' " +
            " or {كيف تصف العمل الخاص بك على حاسوبك المحمول؟} =  'عمل يحتاج الى مواصفات منخفضة' " +
            " or  {ما هو الغرض الاساسي للاستخدام حاسوبك المحمول؟} ='التصفح'",
        },
      ],
    },
    {
      name: "page6",
      elements: [
        {
          type: "boolean",
          name: "هل تحتاج لحاسوب محمول ذو عمر بطارية طويل ؟",
          isRequired: true,
          choices: ["نعم", "لا"],
          description: "ينصح خبراء الحواسيب المحمول في متجرنا في اختيار نعم",
        },
      ],
    },
    {
      name: "page7",
      elements: [
        {
          type: "radiogroup",
          name: "ما نوع التخزين المفضل لك على حاسوبك المحمول ؟",
          isRequired: true,
          choices: ["التخزين على حاسوبك نفسه", "التخزين السحابي (drive...)"],
          description:
            "ينصح خبراء الحواسيب المحمول في متجرنا في اختيار التخزين على حاسوبك نفسه",
        },
      ],
    },
    {
      name: "page8",
      elements: [
        {
          type: "boolean",
          name: "هل سوف تستخدم الحاسوب المحمول للفترة زمنية طويلة ؟",
          isRequired: true,
          choices: ["نعم", "لا"],
          description: "ينصح خبراء الحواسيب المحمول في متجرنا في اختيار نعم",
        },
      ],
    },
  ],
  showPrevButton: false,
  showCompletedPage: false,
  questionDescriptionLocation: "underInput",
};
